app/controllers/animals_controller.rb

  def index
    @animals = Animal.all.page params[:page]
---
SELECT  `animals`.* FROM `animals` LIMIT 1 OFFSET 0

  def create
    @animal = Animal.new(animal_params)

    respond_to do |format|
      if @animal.save
---
INSERT INTO `animals` (`name`, `image`, `species`, `breed`, `note`, `created_at`, `updated_at`) VALUES ('sdf', '1e2a02c5812763c41a1e4553234f67bf.jpg', 'fgf', 'fgdffd', 'gfdh', '2018-05-09 11:49:28', '2018-05-09 11:49:28')

  def set_animal
    @animal = Animal.find(params[:id])
---
SELECT  `animals`.* FROM `animals` WHERE `animals`.`id` = 1 LIMIT 1