app/controllers/animal_histories_controller.rb

  def index
    @animal_histories = AnimalHistory.all.page params[:page]
---
SELECT  `animal_histories`.* FROM `animal_histories` LIMIT 1 OFFSET 0

  def new
    @animal_history = AnimalHistory.new
    @animals = Animal.all
    @vets = Vet.all
---
SELECT `animals`.* FROM `animals`
SELECT `vets`.* FROM `vets`