app/controllers/donations_controller.rb

SELECT  `donations`.* FROM `donations` LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `donations`
---
  def index
    @donations = Donation.all.page params[:page]

SELECT `donor_types`.* FROM `donor_types`
SELECT `animals`.* FROM `animals`
---
  def new
    @donation = Donation.new
    @donations_type = DonorType.all
    @animales = Animal.all

INSERT INTO `donations` (`person`, `donor_type_id`, `amount`, `animal_id`, `created_at`, `updated_at`) VALUES ('gfdgdfg', 2, '4', 1, '2018-05-09 11:49:39', '2018-05-09 11:49:39')
---
  def create
    @donation = Donation.new(donation_params)
    @donations_type = DonorType.all
    @animales = Animal.all
    respond_to do |format|
      if @donation.save

SELECT  `donations`.* FROM `donations` WHERE `donations`.`id` = 1 LIMIT 1
---
  def set_donation
    @donation = Donation.find(params[:id])