app/controllers/donor_types_controller.rb

  def index
    @donor_types = DonorType.all.page params[:page]
---
SELECT  `donor_types`.* FROM `donor_types` LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `donor_types`