app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.all.page params[:page]

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def set_user
    @user = User.find(params[:id])