app/controllers/vets_controller.rb

  def index
    @vets = Vet.all.page params[:page]
---
SELECT  `vets`.* FROM `vets` LIMIT 1 OFFSET 0